// HOMEWORK 8

Console.Clear();
Console.WriteLine("HOMEWORK 8" + "\n");


// Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.


Console.WriteLine("\n" + "Задача 58." + "\n");