// HOMEWORK 8

Console.Clear();
Console.WriteLine("HOMEWORK 8" + "\n");


// Задача 60: Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.



// Сделал сразу одинаковые размеры матриц, что бы можно было перемножать.
Console.WriteLine("\n" + "Задача 60." + "\n");