// HOMEWORK 8

Console.Clear();
Console.WriteLine("HOMEWORK 8" + "\n");


// Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.


Console.WriteLine("\n" + "Задача 62." + "\n");